InformationRegisters/СреднемесячныеПоказанияТемператур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СреднемесячныеПоказанияТемператур</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СреднеМесячнаяТемператураНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднеМесячнаяТемператураРасчет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднеМесячнаяТемператураФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвоРабочихДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвоДнейОтопления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвоДнейОтопленияПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдельнаяНормаУслТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АктСнятияПоказанийГорячейВоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>АктСнятияПоказанийГорячейВоды</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказаниеТекущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазницаПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АктСнятияПоказанийХолоднойВоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>АктСнятияПоказанийХолоднойВоды</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказаниеТекущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазницаПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлощадьЗданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлощадьЗданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлощадьОбъектовЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлощадьОбъектовЛицевыхСчетов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/МетодыУстановкиПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>МетодыУстановкиПриборовУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВКО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПерерасчетПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПерерасчетПоЛС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПерерасчетПоЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвентаризацияАвансов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПересчетОтопление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РасчетУслугПоТЕиГВ/Ext/Module.bsl
// РОЗПОДІЛ ЗАГАЛЬНО-БУДИНКОВОГО ЛІЧИЛЬНИКА ПО ОПАЛЕННЮ
////////////////////////////////////////////////////////////////////////////////////////////////////

// Розподіл загально-будинкового лічильника по тепловій енергії
//
Функция РаспределениеОщедомовогоПрибораУчетаПоТЕ(Документ = Неопределено, ТабличнаяЧасть = Неопределено) Экспорт
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РаспределениеТепловойЕнергии") Тогда
		ДанныеСчетчика    = ПолучитьПоказания(Документ.ОбщедомовойПриборУчета, Документ.ПериодНачисления);
		ЕдИзмСчетчика     = Документ.ОбщедомовойПриборУчета.ЕдиницаИзмерения;
		Если ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("900") Тогда // Из ГДж
			ВсегоГКал = ДанныеСчетчика.КвоТЕ * 0.2388;
		ИначеЕсли ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("901") Тогда // Из МВт
			ВсегоГКал = ДанныеСчетчика.КвоТЕ * 0.8598;
		ИначеЕсли ЕдИзмСчетчика = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("214") Тогда // Из кВт
			ВсегоГКал = ДанныеСчетчика.КвоТЕ * 0.0008598;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПерерасчетПоЛС") Тогда
		Тариф         = ПолучитьТарифПоУслуге(Документ.Услуга);
		ВсегоГКал     = Документ.ОбщедомовоеЗначениеСчетчика;
	КонецЕсли;
	ЗБП               = Документ.Здание.МестаОбщПользования;
	Sобщ_дом          = ПолучитьПлощадьЗдания(Документ.Здание);
	Sобщ_инд_от       = ВыборкаПлощадейИндОтопления(Документ.Здание).Итог("Площадь");
	Sобщ_вро          = ВыборкаПлощадейСВРО(Документ.Здание).Итог("Площадь");
	Qmax              = Документ.Здание.Qmax;
	t_вн_норм         = Документ.Здание.ВнутренняяТемператураЗдания;
	коеф_Z            = 1 + (Sобщ_инд_от / Sобщ_дом);
	t_сер_оп_пер      = Константы.t_сер_оп_пер.Получить();
	t_min_оп_пер      = Константы.t_min_оп_пер.Получить();
	По_               = (Константы.ДатаОкончанияОтопительногоСезона.Получить() - Константы.ДатаНачалаОтопительногоСезона.Получить()) / 86400;
	Пр                = Число(Сред(КонецМесяца(Документ.ПериодНачисленияОкончание), 1, 2));	
	
	
	// Нормативне теплове навантаження будівлі/будинку, Гкал/год
	Q_буд_норм = Qmax*((t_вн_норм - t_сер_оп_пер) / (t_вн_норм - t_min_оп_пер));
	
	// Кількість теплової енергії, спожитої будівлею/будинком за опалювальний період 
	Q_буд_за_оп_пер_норм = Q_буд_норм * 24 * По_;
	
	// Фактичний обсяг спожитої у будівлі/будинку теплової енергії у розрахунковому періоді
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	СреднемесячныеПоказанияТемператур.СреднеМесячнаяТемператураФакт
	    |ИЗ
	    |	РегистрСведений.СреднемесячныеПоказанияТемператур КАК СреднемесячныеПоказанияТемператур
	    |ГДЕ
	    |	СреднемесячныеПоказанияТемператур.Месяц = &Месяц";
	Запрос.УстановитьПараметр("Месяц", Документ.ПериодНачисленияОкончание);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			t_факт = Выборка.СреднеМесячнаяТемператураФакт;
		КонецЦикла;
	Иначе
		t_факт = 0;
	КонецЕсли;
	
	ЗначениеЗБП = (ВсегоГКал * (Документ.Здание.МестаОбщПользования / 100)) * коеф_Z;
    ЗБП_Нам2 = ЗначениеЗБП / Sобщ_дом;
	 
	Q_оп_буд = (1 - (Sобщ_инд_от/Sобщ_дом)) * Q_буд_норм * (Пр * 24) * ((t_вн_норм - t_факт) / (t_вн_норм - t_сер_оп_пер));
	
	// Норма споживання (Nбуд) теплової енергії у будівлі/будинку протягом опалювального періоду
	Nбуд = Q_буд_за_оп_пер_норм / Sобщ_дом;
	
	// Середнє питоме споживання теплової енергії на опалення приміщень 
    q_оп = (ВсегоГКал - ЗначениеЗБП) / (Sобщ_дом - Sобщ_инд_от);
	
	// Мінімальна частка середнього питомого споживання теплової енергії 
	q_min = 0.5 * q_оп;
	
	// Максимальна частка питомого споживання теплової енергії 
	q_max = Nбуд * ((t_вн_норм - t_min_оп_пер) / (t_вн_норм - t_сер_оп_пер)) * (Пр / По_);
	
	
	
	// Об'єкти, що мають лічильники з опалення ВРО  
	КвоВРО = КоличествоПриборовВДоме(Перечисления.МетодыУстановкиПриборовУчета.ВРО, , Документ.ПериодНачисленияОкончание);
	Если КвоВРО.Количество() <> 0 Тогда
		КвоВРО.Колонки.Добавить("Q_дон");
		КвоВРО.Колонки.Добавить("ГКал");
		Для Каждого стр Из КвоВРО Цикл
			// Донарахування до мінімального споживання теплової енергії у опалювальному приміщенні з приладом обліку
			ПлощадьКвартиры = ПолучитьПлощадьОбъектовЛицевыхСчетов(стр.ОбъектУстановки.ОбъектЛицевогоСчета, Документ.Здание, Документ.ПериодНачисленияОкончание);
			Если (стр.Значение / ПлощадьКвартиры) < q_min Тогда
				стр.Q_дон = (q_min - (стр.Значение / ПлощадьКвартиры)) * ПлощадьКвартиры;
			КонецЕсли;
		КонецЦикла;
		СуммаГКалДонараховних = КвоВРО.Итог("Q_дон");
		СуммаГКалЗаВРО        = КвоВРО.Итог("Значение");
	Иначе
		СуммаГКалДонараховних = 0;
		СуммаГКалЗаВРО        = 0;
	КонецЕсли;
	ЗначениеТЕБезСчетчиков = ВсегоГКал - ЗначениеЗБП - СуммаГКалЗаВРО - СуммаГКалДонараховних;								 
    НаСпоживача_м2 = ЗначениеТЕБезСчетчиков / (Sобщ_дом - Sобщ_инд_от - Sобщ_вро);
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		Если Строка.ЛицевойСчет.ИндОтопление Тогда
			Строка.ПоказаниеТекущие = ЗБП_Нам2 * Строка.ОтапливаемаяПлощадь;
			Строка.СуммаТекущийРасчет = Строка.ПоказаниеТекущие * Тариф.ЗначениеТарифа;
		ИначеЕсли Строка.ЛицевойСчет.ВРО Тогда
			ВРО = КоличествоПриборовВДоме(Перечисления.МетодыУстановкиПриборовУчета.ВРО, Строка.ЛицевойСчет, Документ.ПериодНачисленияОкончание)[0].Значение;
			// Середнє питоме споживання теплової енергії на опалення приміщень 
		    q_оп = (ВсегоГКал - ЗначениеЗБП) / (Sобщ_дом - Sобщ_инд_от);
			
			// Мінімальна частка середнього питомого споживання теплової енергії 
			q_min = 0.5 * q_оп;
			Если (ВРО / Строка.ОтапливаемаяПлощадь) < q_min Тогда
			    Qдон = (q_min - (ВРО / Строка.ОтапливаемаяПлощадь)) * Строка.ОтапливаемаяПлощадь;
			КонецЕсли;
			Строка.ПоказаниеТекущие = (ЗБП_Нам2 * Строка.ОтапливаемаяПлощадь) + Qдон + ВРО;
			Строка.СуммаТекущийРасчет = Строка.ПоказаниеТекущие * Тариф.ЗначениеТарифа;
		Иначе
			Строка.ПоказаниеТекущие = (ЗБП_Нам2 * Строка.ОтапливаемаяПлощадь) + (НаСпоживача_м2 * Строка.ОтапливаемаяПлощадь);
			Строка.СуммаТекущийРасчет = Строка.ПоказаниеТекущие * Тариф.ЗначениеТарифа;
		КонецЕсли;
	КонецЦикла;
	Возврат ТабличнаяЧасть;
КонецФункции


// Перерозподіл розподілу по тепловій енергії
//
Функция ПерерасчетОтопление(Документ = Неопределено, ТабличнаяЧасть = Неопределено) Экспорт
	тзПерерасчет = Новый ТаблицаЗначений;
	тзПерерасчет = ТабличнаяЧасть.Скопировать();
	
    МассивЛС = тзПерерасчет.ВыгрузитьКолонку("ЛицевойСчет");
	
	КвалификаторыЧисла15_2 = Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой);
	КвалификаторыЧисла15_6 = Новый КвалификаторыЧисла(15, 6, ДопустимыйЗнак.Любой);
	КвалификаторыЧисла2_0  = Новый КвалификаторыЧисла(2,  0, ДопустимыйЗнак.Любой);
	КвалификаторыЧисла2_2  = Новый КвалификаторыЧисла(2,  2, ДопустимыйЗнак.Любой);
	
	Если Документ.ВидОперации = Перечисления.ВидыОперацийПерерасчетПоЛС.ПересчетОтопление Тогда
		тзПерерасчет.Колонки.Добавить("Здание", Новый ОписаниеТипов("СправочникСсылка.ЗданияИСооружения"), "Будинок");
		тзПерерасчет.Колонки.Добавить("ОтапливаемаяПлощадьЗдания", Новый ОписаниеТипов("Число", КвалификаторыЧисла15_2), "Опалювальна площа будинку");
		тзПерерасчет.Колонки.Добавить("Услуга", Новый ОписаниеТипов("СправочникСсылка.Услуги"), "Послуга");
		тзПерерасчет.Колонки.Добавить("ОтапливаемаяПлощадь", Новый ОписаниеТипов("Число", КвалификаторыЧисла15_2), "Опалювальна площа");
		
		Для Каждого стр Из тзПерерасчет Цикл
			стр.Здание                    = Документ.Здание;
			стр.ОтапливаемаяПлощадьЗдания = ПолучитьПлощадьЗдания(стр.Здание);
			стр.Услуга                    = Документ.Услуга;
			стр.ОтапливаемаяПлощадь       = ПолучитьПлощадь(стр.ЛицевойСчет, КонецМесяца(Документ.ПериодНачисленияОкончание), Документ.Услуга);
		КонецЦикла;
		тзПерерасчет_ = РаспределениеОщедомовогоПрибораУчетаПоТЕ(Документ, тзПерерасчет);
		Возврат тзПерерасчет_;
	КонецЕсли;
	
КонецФункции



// РОЗПОДІЛ ЗАГАЛЬНО-БУДИНКОВИХ ЛІЧИЛЬНИКІВ ПО ГАРЯЧОМУ ТА ХОЛОДНОМУ ВОДОПОСТАЧАННЮ
////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьПоказанияПрибораУчетаПоГВ(ПриборУчета, ПериодНачисления) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	АктСнятияПоказанийГорячейВодыСрезПоследних.ПоказаниеПредыдущее
	    |ИЗ
	    |	РегистрСведений.АктСнятияПоказанийГорячейВоды.СрезПоследних(&НаДату, ПриборУчета = &ПриборУчета) КАК АктСнятияПоказанийГорячейВодыСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", КонецМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Показание = 0;
		Возврат Показание;
	Иначе
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
		    Показание = Выборка.ПоказаниеПредыдущее;
		КонецЦикла;
	    Возврат Показание;
	КонецЕсли;
КонецФункции

Функция ПолучитьПоказанияПрибораУчетаПоХВ(ПриборУчета, ПериодНачисления) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	АктСнятияПоказанийХолоднойВодыСрезПоследних.ПоказаниеТекущее
	    |ИЗ
	    |	РегистрСведений.АктСнятияПоказанийХолоднойВоды.СрезПоследних(&НаДату, ПриборУчета = &ПриборУчета) КАК АктСнятияПоказанийХолоднойВодыСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", КонецМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Показание = 0;
		Возврат Показание;
	Иначе
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
		    Показание = Выборка.ПоказаниеТекущее;
		КонецЦикла;
	    Возврат Показание;
	КонецЕсли;
КонецФункции


// ДОДАТКОВІ ПРОЦЕДУРИ І ФУНКЦІЇ
///////////////////////////////////////////////////////////////////////////////////////////////////

// Показники приладів по опаленню
//
Функция ПолучитьПоказания(ПриборУчета, ПериодНачисления) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ ПЕРВЫЕ 1
	    |	АктСнятияПоказанийТеплосчетчикаСрезПоследних.РазницаПоказания,
	    |	АктСнятияПоказанийТеплосчетчикаСрезПоследних.Период,
	    |	АктСнятияПоказанийТеплосчетчикаСрезПоследних.ЧасыПростояРазница,
	    |	АктСнятияПоказанийТеплосчетчикаСрезПоследних.РазницаЧасы КАК ЧасыРаботы
	    |ИЗ
	    |	РегистрСведений.АктСнятияПоказанийТеплосчетчика.СрезПоследних(
	    |			,
	    |			ПриборУчета = &ПриборУчета
	    |				) КАК АктСнятияПоказанийТеплосчетчикаСрезПоследних";
	Запрос.УстановитьПараметр("ДатаСреза", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	Запрос.УстановитьПараметр("ПериодНачисления", НачалоМесяца(ПериодНачисления));
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		ДанныеВыборки = Новый Структура;
		Пока Выборка.Следующий() Цикл
			ДанныеВыборки.Вставить("КвоТЕ",       Выборка.РазницаПоказания);
			ДанныеВыборки.Вставить("ДатаСнятия",  Выборка.Период);
			ДанныеВыборки.Вставить("ЧасыПростоя", Выборка.ЧасыПростояРазница);
			ДанныеВыборки.Вставить("ЧасыРаботы",  Выборка.ЧасыРаботы);
		КонецЦикла;
		Возврат ДанныеВыборки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьПоказанияПрибораУчетаПоТЕ(ПриборУчета, ПериодНачисления) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ ПЕРВЫЕ 1
	    |	АктСнятияПоказанийТеплосчетчикаСрезПоследних.ПоказаниеТекущее,
	    |	АктСнятияПоказанийТеплосчетчикаСрезПоследних.НаработкаТеплосчетчикаТекущее,
	    |	АктСнятияПоказанийТеплосчетчикаСрезПоследних.ОбъемВодыПоТеплоСчетчикуТекущее,
	    |	АктСнятияПоказанийТеплосчетчикаСрезПоследних.ЧасыПростояТекущие,
	    |	АктСнятияПоказанийТеплосчетчикаСрезПоследних.РазницаПоказания
	    |ИЗ
	    |	РегистрСведений.АктСнятияПоказанийТеплосчетчика.СрезПоследних(, ПриборУчета = &ПриборУчета) КАК АктСнятияПоказанийТеплосчетчикаСрезПоследних
		//|ГДЕ
		//|	АктСнятияПоказанийТеплосчетчикаСрезПоследних.Период МЕЖДУ &ПериодНач И &ПериодКон
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	АктСнятияПоказанийТеплосчетчикаСрезПоследних.Период УБЫВ";
	////Запрос.УстановитьПараметр("ПериодКон", ДобавитьМесяц(КонецМесяца(ПериодНачисления), -1));
	////Запрос.УстановитьПараметр("ПериодНач", ДобавитьМесяц(НачалоМесяца(ПериодНачисления), -1));
	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ДанныеВыборки = Новый Структура;
	Пока Выборка.Следующий() Цикл
		ДанныеВыборки.Вставить("ПоказаниеПредыдущее",       Выборка.ПоказаниеТекущее);
		ДанныеВыборки.Вставить("ЧасыНаработкиПредыдущие",   Выборка.НаработкаТеплосчетчикаТекущее);
		ДанныеВыборки.Вставить("ОбъемВодыПоТеплоСчетчикуПредыдущие", Выборка.ОбъемВодыПоТеплоСчетчикуТекущее);
		ДанныеВыборки.Вставить("ЧасыПростоя", Выборка.ЧасыПростояТекущие);
		ДанныеВыборки.Вставить("РазницаПоказания", Выборка.РазницаПоказания);
	КонецЦикла;
	Возврат ДанныеВыборки;
КонецФункции

//Функция ПолучитьПоказанияПрибораУчетаПОХВ(ПриборУчета, ПериодНачисления) Экспорт
//    Запрос = Новый Запрос;
//	Запрос.Текст =
//	    "ВЫБРАТЬ
//	    |	АктСнятияПоказанийХолоднойВодыСрезПоследних.ПоказаниеПредыдущее,
//	    |	АктСнятияПоказанийХолоднойВодыСрезПоследних.ПоказаниеТекущее,
//	    |	АктСнятияПоказанийХолоднойВодыСрезПоследних.РазницаПоказания
//	    |ИЗ
//	    |	РегистрСведений.АктСнятияПоказанийХолоднойВоды.СрезПоследних(&ДатаСреза, ПриборУчета = &ПриборУчета) КАК АктСнятияПоказанийХолоднойВодыСрезПоследних";
//	Запрос.УстановитьПараметр("ДатаСреза", Новый Граница(ПериодНачисления, ВидГраницы.Включая));
//	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	Выборка = РезультатЗапроса.Выбрать();
//	ДанныеВыборки = Новый Структура;
//	Пока Выборка.Следующий() Цикл
//		ДанныеВыборки.Вставить("ПоказаниеПредыдущее",       Выборка.ПоказаниеТекущее);
//	КонецЦикла;
//	Возврат ДанныеВыборки;
//КонецФункции

// Отримати загальну опалювальну площу будинку
//
Функция ПолучитьПлощадьЗдания(Здание) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ПлощадьЗданий.Площадь
	    |ИЗ
	    |	РегистрСведений.ПлощадьЗданий КАК ПлощадьЗданий
	    |ГДЕ
	    |	ПлощадьЗданий.Здание = &Здание
	    |	И ПлощадьЗданий.ВидПлощади = &ВидПлощади";
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("ВидПлощади", Справочники.ВидыПлощадей.ОтапливаемаяПлощадь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Площадь = Выборка.Площадь;
	КонецЦикла;
	Возврат Площадь;
КонецФункции

// Отримати опалювальну площу споживачів, відповідальних власників 
//
Функция ПолучитьПлощадь(ЛицевойСчет, Период = Неопределено, Услуга = "")
	ТекстЗапроса =
			"ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	ЕСТЬNULL(ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь, 0) КАК ЗначениеБазы,
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ОтветственныйВладелец,
			|	&Период КАК Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
			|				И ЛицевойСчет = &ЛицевойСчет) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&Период, ВидПлощади = &ВидБазыРаспределения) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
			|	ЕСТЬNULL(ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь, 0),
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
			|	НазначенныеУслугиСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
			|				И ЛицевойСчет = &ЛицевойСчет) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&Период, ВидПлощади = &ВидБазыРаспределения) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ЛОЖЬ
			|	И НазначенныеУслугиСрезПоследних.Период > НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
		
	Запрос.УстановитьПараметр("Период", КонецМесяца(Период));		
	Запрос.УстановитьПараметр("Услуга", Услуга);		
	Запрос.УстановитьПараметр("ВидБазыРаспределения", Услуга.БазаРаспределенияРасчетнойУслуги);		
	Запрос.УстановитьПараметр("Здание", ЛицевойСчет.Владелец);
    Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	ТаблицаЛицевыхСчетов = Запрос.Выполнить().Выгрузить();
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Площадь = 0;
		Возврат Площадь;
	Иначе
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Площадь = Выборка.ЗначениеБазы;
		КонецЦикла;
		Возврат Площадь;
	КонецЕсли;
КонецФункции

// Отримати опалювальну площу споживачів з індивідуальним опаленням
//
Функция ВыборкаПлощадейИндОтопления(Здание) Экспорт
    ЗапросЛС = Новый Запрос;
	ЗапросЛС.Текст =
	   "ВЫБРАТЬ
	   |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет,
	   |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь
	   |ИЗ
	   |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, ) КАК ЛицевыеСчетаСрезПоследних
	   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&НаДату, ) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
	   |		ПО ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
	   |ГДЕ
	   |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец = &Владелец
	   |	И ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади = &ВидПлощади
	   |	И ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ИндОтопление = ИСТИНА"; 
	ЗапросЛС.УстановитьПараметр("Владелец", Здание);
	ЗапросЛС.УстановитьПараметр("НаДату", ТекущаяДата());
	ЗапросЛС.УстановитьПараметр("ВидПлощади", Справочники.ВидыПлощадей.ОтапливаемаяПлощадь);
	Результат = ЗапросЛС.Выполнить().Выгрузить();

	Возврат Результат;
КонецФункции

// Отримати опалювальну площу споживачів з лічильниками ВРО
//
Функция ВыборкаПлощадейСВРО(Здание, Подъезд = "") Экспорт
	Запрос = Новый Запрос;
	Условие = "";
	Если Подъезд <> "" Тогда
		Условие = " И ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение.Подъезд = &Подъезд";
		Запрос.УстановитьПараметр("Подъезд", Подъезд);
	КонецЕсли;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь,
	    |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки
	    |ИЗ
	    |	РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&НаДату, ) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&НаДату, ) КАК УстановленныеПриборыУчетаСрезПоследних
	    |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчета.СрезПоследних КАК ЛицевыеСчетаСрезПоследних
	    |			ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ЛицевыеСчетаСрезПоследних.ЛицевойСчет
	    |		ПО (УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение)
	    |ГДЕ
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ВРО = ИСТИНА " + Условие + "
	    |	И ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади = &ВидПлощади
	    |	И ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец = &Здание";
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("ВидПлощади", Справочники.ВидыПлощадей.ОтапливаемаяПлощадь);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции

// Отримати опалювальну площу споживачів без лічильників
//
Функция ПолучитьПлощадьОбъектовЛицевыхСчетов(Помещение, Здание, ПериодНачисления) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь
	    |ИЗ
	    |	РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(
	    |			&НаДату,
	    |			Помещение.Владелец = &Здание
	    |				И ВидПлощади = &ВидПлощади
	    |				И Помещение = &Помещение) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", КонецМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("Помещение", Помещение);
	Запрос.УстановитьПараметр("ВидПлощади", Справочники.ВидыПлощадей.ОтапливаемаяПлощадь);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПлощадьПомещения = Выборка.Площадь;
		КонецЦикла;
		Возврат ПлощадьПомещения;
	Иначе
		ПлощадьПомещения = 0;
		Возврат ПлощадьПомещения;
	КонецЕсли;
КонецФункции

Функция КоличествоПриборовВДоме(МетодУстановкиПрибора, ЛицевойСчет = "", ПериодНачисления) Экспорт
	Запрос = Новый Запрос;
	Условие = "";
	Если ЛицевойСчет <> "" Тогда
		Условие = " И ОбъектУстановки = &ЛицевойСчет";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	КонецЕсли;
	Если МетодУстановкиПрибора = Перечисления.МетодыУстановкиПриборовУчета.ВКО Тогда
		Условие = Условие + " И ПриборУчета.ВКО = ИСТИНА И ПриборУчета.ОбщедомовойСчетчик = ЛОЖЬ";
	Иначе
		Условие = Условие + " И ПриборУчета.ВРО = ИСТИНА";
	КонецЕсли;
	Запрос.Текст = 
	    "ВЫБРАТЬ ПЕРВЫЕ 1
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
	    |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ВРО,
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ВКО,
	    |	РасчетПоказанийПриборовОтопление.Значение,
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Коэффициент
	    |ИЗ
	    |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
	    |			&НаДату,
	    |			ПриборУчета.Услуга.ВидУслуги = &ВидУслуги
	    |				И Действует = ИСТИНА " + Условие + ") КАК УстановленныеПриборыУчетаСрезПоследних
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетПоказанийПриборовОтопление КАК РасчетПоказанийПриборовОтопление
	    |		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = РасчетПоказанийПриборовОтопление.ПриборУчета
		|УПОРЯДОЧИТЬ ПО
	    |	РасчетПоказанийПриборовОтопление.Период УБЫВ";
	Запрос.УстановитьПараметр("НаДату", НачалоМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("ВидУслуги", Справочники.ВидыУслуг.Отопление);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции

// " + Условие + " 

Функция ПолучитьТарифПоУслуге(Услуга) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТарифыСрезПоследних.ЗначениеТарифа,
		|	ТарифыСрезПоследних.НормаПотребления,
		|	ТарифыСрезПоследних.ЗначениеТарифаПоНорме
		|ИЗ
		|	РегистрСведений.Тарифы.СрезПоследних(&Период, Услуга = &Услуга)  КАК ТарифыСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Услуга", Услуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Тарифы = Новый Структура;
	
	Пока Выборка.Следующий() Цикл
		Тарифы.Вставить("ЗначениеТарифа", Выборка.ЗначениеТарифа);
		Тарифы.Вставить("НормаПотребления", Выборка.НормаПотребления);
		Тарифы.Вставить("ЗначениеТарифаПоНорме", Выборка.ЗначениеТарифаПоНорме);
	КонецЦикла;
    Возврат Тарифы;
КонецФункции

Функция ПолучитьРаспределениеПрошлогоМесяца(ПриборУчета, Объект = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	РаспределениеГорячейВодыСрезПоследних.ЗначениеДляРаспределеня
	    |ИЗ
	    |	РегистрСведений.РаспределениеГорячейВоды.СрезПоследних КАК РаспределениеГорячейВодыСрезПоследних
	    |ГДЕ
	    |	РаспределениеГорячейВодыСрезПоследних.Период МЕЖДУ &НачПериода И &КонПериода
	    |	И РаспределениеГорячейВодыСрезПоследних.ОбщедомовойПриборУчета = &ОбщедомовойПриборУчета
	    |	И РаспределениеГорячейВодыСрезПоследних.Активность = ИСТИНА";
	Запрос.УстановитьПараметр("ОбщедомовойПриборУчета", ПриборУчета);
	Запрос.УстановитьПараметр("НачПериода", ДобавитьМесяц(НачалоМесяца(Объект.Дата), -1));
	Запрос.УстановитьПараметр("КонПериода", ДобавитьМесяц(КонецМесяца(Объект.Дата), -1));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Значение = Выборка.ЗначениеОбщедомовое;
	КонецЦикла;
	Если Значение = Неопределено Тогда
		Значение = 0;
	КонецЕсли;
	Возврат Значение;
КонецФункции

// Отримати опалювальну площу споживачів з лічильниками ВКО
//
Функция ВыборкаПлощадейСВКО(Здание, Подъезд = "") Экспорт
	Запрос = Новый Запрос;
	Если Подъезд <> "" Тогда
		Условие = " И ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение.Подъезд = &Подъезд";
		Запрос.УстановитьПараметр("Подъезд", Подъезд);
	КонецЕсли;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь,
	    |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки
	    |ИЗ
	    |	РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&НаДату, ) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&НаДату, ) КАК УстановленныеПриборыУчетаСрезПоследних
	    |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчета.СрезПоследних КАК ЛицевыеСчетаСрезПоследних
	    |			ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ЛицевыеСчетаСрезПоследних.ЛицевойСчет
	    |		ПО (УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение)
	    |ГДЕ
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ВКО = ИСТИНА " + Условие + "
	    |	И ПлощадьОбъектовЛицевыхСчетовСрезПоследних.ВидПлощади = &ВидПлощади
	    |	И ЛицевыеСчетаСрезПоследних.ЛицевойСчет.Владелец = &Здание";
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("ВидПлощади", Справочники.ВидыПлощадей.ОтапливаемаяПлощадь);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции

Функция ТаблицаЛС(ПериодНачисления, Услуга, ВидБазыРаспределения, Здание, Подъезд) Экспорт
	ТекстЗапроса =
			"ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
			|	ЕСТЬNULL(ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь, 0) КАК ЗначениеБазы,
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец КАК ОтветственныйВладелец,
			|	&Период КАК Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
			//|				И НЕ ЛицевойСчет В (&СписокЛицевыхСчетов)
			|				И ВЫБОР
			|					КОГДА &Подъезд = ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд = &Подъезд
			|				КОНЕЦ) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&Период, ВидПлощади = &ВидБазыРаспределения) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
			|	ЕСТЬNULL(ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Площадь, 0),
			|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета,
			|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
			|	НазначенныеУслугиСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
			|			&Период,
			|			ЛицевойСчет.Владелец = &Здание
			|				И Услуга = &Услуга
			//|				И НЕ ЛицевойСчет В (&СписокЛицевыхСчетов)
			|				И ВЫБОР
			|					КОГДА &Подъезд = ЗНАЧЕНИЕ(Справочник.Подъезды.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ЛицевойСчет.ОбъектЛицевогоСчета.Подъезд = &Подъезд
			|				КОНЕЦ) КАК НазначенныеУслугиСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлощадьОбъектовЛицевыхСчетов.СрезПоследних(&Период, ВидПлощади = &ВидБазыРаспределения) КАК ПлощадьОбъектовЛицевыхСчетовСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета = ПлощадьОбъектовЛицевыхСчетовСрезПоследних.Помещение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(&Период, ) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
			|		ПО НазначенныеУслугиСрезПоследних.ЛицевойСчет = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
			|ГДЕ
			|	НазначенныеУслугиСрезПоследних.Действует = ЛОЖЬ
			|	И НазначенныеУслугиСрезПоследних.Период > НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
			
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
		
	Запрос.УстановитьПараметр("Период", КонецМесяца(ПериодНачисления));		
	Запрос.УстановитьПараметр("Услуга", Услуга);		
	Запрос.УстановитьПараметр("ВидБазыРаспределения", Услуга.БазаРаспределенияРасчетнойУслуги);		
	Запрос.УстановитьПараметр("Здание", Здание);
	Запрос.УстановитьПараметр("Подъезд", Подъезд);
	ТаблицаЛицевыхСчетов = Запрос.Выполнить().Выгрузить();
	
	ИтогБазы = ТаблицаЛицевыхСчетов.Итог("ЗначениеБазы");
	Если ИтогБазы = 0 Тогда
		Сообщить(НСтр("ru='Итог по площади равен нулю.';uk='Підсумок по площі дорівнює нулю.'"));
		Возврат 0;
	Иначе
		Возврат ИтогБазы;
	КонецЕсли;
КонецФункции
